// функція для можливості типізації отриманого значення з лс
export const retriveLocalStorageData = <T>(key: string) => {
    // отримую значення, якщо приходить null - то записую в отримання значення пустий рядок,
    // так простіше потім перевіряти
    const pairJSON = localStorage.getItem(key) || '';

    // парсинг отрманого значення, якщо там пуста стрінга
    const pair = JSON.parse(pairJSON);

    // то ось тут повертаю пустий об'єкт закастований до потрібного типу
    if (!pairJSON) return {} as T;

    // ну і повертаю об'єкт з лс закастований до потрібного типу якщо все гуд
    return pair as T;
}